doc/proxy/02-request.xml

<!--

POST /sys_update_set.do?SOAP&displayvalue=all&redirectSupported=true

-->
<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <getRecords xmlns="http://www.service-now.com">
            <__encoded_query>sys_idINa5557e2feb77f740c6e63c4fea887efb</__encoded_query>
            <__limit>250</__limit>
            <__attributes>
                <__attribute>
                    <name>emit_count</name>
                    <value>true</value>
                </__attribute>
            </__attributes>
        </getRecords>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
